# 發生錯誤時執行終止指令
set -e

# 顏色設置
lgreen='\033[1;32m'
yellow='\033[1;33m'
norm='\033[0m'

# Start
echo
echo "${lgreen}=============================================================="
echo " 一鍵部署 5 秒後開始運作 "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"

sleep 5

echo
echo "${yellow}=============================================================="
echo " 準備取得 Git 遠端 Url..."
echo "==============================================================${norm}"

sleep 1
originUrl=$(git config --get remote.origin.url)

echo
echo "${yellow}=============================================================="
echo " 準備取得當前 Git Branch 名稱"
echo "==============================================================${norm}"

sleep 1
branchName=$(git branch --show-current)

echo
echo "${lgreen}=============================================================="
echo " 目前遠端分支: ${originUrl} "
echo "==============================================================${norm}"

sleep 1

echo
echo "${lgreen}=============================================================="
echo " 傳輸方式將採用 'SSH' "
echo " 目前遠端分支 URL：$originUrl "
echo " 當前分支是：$branchName "
echo "==============================================================${norm}"

sleep 5

echo
echo "${lgreen}=============================================================="
echo " 5 秒後開始打包編譯 "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"

npm run build

echo
echo "${lgreen}=============================================================="
echo " 編譯完成 "
echo "==============================================================${norm}"

echo
echo "${yellow}=============================================================="
echo " 移動到編譯完成的資料夾 "
echo "==============================================================${norm}"

cd dist

echo
echo "${yellow}=============================================================="
echo " 初始化 Git 與加入 Commit "
echo "==============================================================${norm}"

git init
git add .
git commit -m "update `date +'%Y-%m-%d %H:%M:%S'`";
git branch -M $branchName

echo
echo "${yellow}=============================================================="
echo " 5 秒後部署檔案到遠端分支 "
echo " ＊如要停止動作請按下 CRTL + C or Control + C"
echo "==============================================================${norm}"

sleep 5
git push -f $originUrl $branchName:gh-pages


echo
echo "${yellow}=============================================================="
echo " 部署完成 "
echo "==============================================================${norm}"

echo
echo "${lgreen}=============================================================="
echo " 一鍵部署指令結束 "
echo "==============================================================${norm}"